src/Catalogs/ar_Tools.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ar_Tools</Name>
			<Comment>Реестр инструментов (tools) агентов AgentRunner. META-12.</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ar_Имя</Name>
					<Comment>Идентификатор tool в snake_case (search_clients). Уникален, проверяется в ОбработкаПроверкиЗаполнения.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Представление</Name>
					<Comment>Короткое человекочитаемое название tool для попапа композера (UI). Если пусто - показывается ar_Имя.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Описание</Name>
					<Comment>Краткое описание tool для отображения в UI списка.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_JSONManifest</Name>
					<Comment>Манифест tool в формате JSON Schema (name, description, parameters). Передаётся LLM.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_RiskLevel</Name>
					<Comment>Уровень риска вызова tool (Low/Medium/High/Critical). META-06.</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ar_RiskLevel</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ОбщийМодуль</Name>
					<Comment>Имя общего модуля-реализации (например aosToolCRM). Используется диспетчером aosToolDispatcher.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ИмяПроцедуры</Name>
					<Comment>Имя экспортной процедуры внутри общего модуля (например search_clients).</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ТребуетApproval</Name>
					<Comment>Если Истина — вызов tool ставится в очередь ar_ОчередьApproval вместо немедленного выполнения.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Включён</Name>
					<Comment>Признак активности tool. Неактивные tools игнорируются диспетчером и не передаются LLM.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Версия</Name>
					<Comment>SemVer реализации tool (например 1.0.0). Используется для отладки и совместимости.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ИсточникРасширение</Name>
					<Comment>Имя расширения, добавившего tool. Пусто = ядро AgentRunner. Заполняется Expert Pack при инициализации.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ТипРеализации</Name>
					<Comment>Режим реализации tool: «Процедура» (пусто = Процедура, общий модуль + процедура) или «Код» (произвольный код 1С из ar_КодРеализации).</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_КодРеализации</Name>
					<Comment>Произвольный код 1С tool (ar_ТипРеализации = «Код»). Выполняется диспетчером ar_ToolDispatcher через Выполнить() в безопасном режиме. SEC-TOOL-01: безопасный режим НЕ гарантирует блокировку чтения данных сессии, записи в обход ar_ОчередьApproval и HTTP-эксфильтрации — диспетчеризация требует явного разрешения администратора (константа ar_РазрешитьТулыВРежимеКод, по умолчанию Ложь). См. .docs/Модель-угроз-режим-Код.md.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ТребуемыеОбъекты</Name>
					<Comment>JSON-массив логических имён объектов метаданных (например ["СчетНаОплатуПокупателю","Контрагенты"]), без которых tool не может отработать. Проверяется через ar_ToolDispatcher.ИмяОбъектаМетаданных + Метаданные.Документы.Найти()/Метаданные.Справочники.Найти(). Пусто или [] — tool не привязан к предметным объектам (универсальный, всегда доступен по этому критерию).</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ПоддерживаемыеКонфигурации</Name>
					<Comment>Список типов конфигурации через запятую (например "БП,УТ"), на которых tool имеет смысл. Пусто — любая конфигурация. Проверяется в ar_ToolDispatcher.ПроверитьДоступностьTool сравнением с ar_ПрофильКонфигурации.ОпределитьКонфигурацию().Тип (UNIV-01); результат кэшируется в ar_Доступен.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Доступен</Name>
					<Comment>Вычисляемый кэш результата ar_ToolDispatcher.ПроверитьДоступностьTool() — НЕ воля администратора. Обновляется автоматически при ЗарегистрироватьВсеTools() и при обновлении версии расширения. В отличие от ar_Включён (которое администратор выставляет вручную, чтобы отключить рабочий tool), ar_Доступен = Ложь означает «физически не может отработать на этой базе» — администратор это поле не редактирует руками. Фильтруется в ar_RuntimeКонтекст.СобратьОпределенияTools.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ПричинаНедоступности</Name>
					<Comment>Хранимый кэш причины ar_Доступен = Ложь для отображения в форме списка без захода в карточку. Заполняется в той же точке, что и ar_Доступен (ar_ToolDispatcher.ПроверитьДоступностьTool/ПересчитатьДоступностьВсехTools), пересчитывается вместе с ним и быстро устаревает при изменении состава метаданных.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ТребуетАдаптер</Name>
					<Comment>Истина — tool делегирует заполнение документа в ar_АдаптерЗаполнения; доступность (ar_Доступен) дополнительно зависит от наличия зарегистрированного и включённого адаптера для текущего типа конфигурации (см. ar_АдаптерЗаполнения.ЕстьАдаптерДляТекущейКонфигурации). Не путать с ar_ТребуемыеОбъекты — то проверяет наличие объектов метаданных, это — наличие кода-адаптера.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Категория</Name>
					<Comment>Группа для попапа композера (UI). Заполняется ar_ToolDispatcher.ЗаполнитьПредставленияВсехTools.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ar_ТипСобытия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ar_ТипСобытия</Name>
			<Comment>Тип записи в ar_СобытияЗапуска. Используется aosAuditСобытия.Зафиксировать и Run Viewer для классификации шагов цикла агента.</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Started</Name>
					<Comment>Фиксируется при старте loop. Payload: {agent_id, trigger, user_id}.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ContextBuilt</Name>
					<Comment>После aosRuntimeКонтекст.ПостроитьКонтекст. Payload: {tokens_estimate, layers}.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>LLMCalled</Name>
					<Comment>После получения ответа от провайдера. Payload: {model, prompt_tokens, completion_tokens, latency_ms}.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ToolCalled</Name>
					<Comment>После выполнения tool. Payload: {tool_name, arguments_json, observation, risk_level}.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PermissionCheck</Name>
					<Comment>Результат aosPermissionEngine.РазрешитьДействие. Payload: {action, result, reason}.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ApprovalRequested</Name>
					<Comment>Action попал в очередь ar_ОчередьApproval. Payload: {approval_id, tool_name, risk_level, justification}.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Approved</Name>
					<Comment>Оператор принял действие в очереди подтверждений. Payload: {approval_id, user_id}.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Rejected</Name>
					<Comment>Оператор отклонил действие в очереди подтверждений. Payload: {approval_id, user_id, reason}.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Denied</Name>
					<Comment>Permission engine вернул deny. Payload: {action, reason}.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Paused</Name>
					<Comment>Loop приостановлен перед approval; StateSnapshot сохранён. Payload: {approval_id}.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Resumed</Name>
					<Comment>Loop возобновлён после approve через регламентное ar_ВозобновлениеПослеApproval. Payload: {approval_id}.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Completed</Name>
					<Comment>Финальный: LLM вернул stop без pending tool calls. Payload: {steps_total, tokens_total}.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Failed</Name>
					<Comment>Финальный: необработанное исключение в loop или сбой LLM. Payload: {error_text} (очищен через aosУтилиты.ОчиститьОшибкуДляLLM).</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>MaxStepsReached</Name>
					<Comment>Финальный: счётчик шагов превысил МаксШагов агента. Payload: {steps_done, max_steps}.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HookFailed</Name>
					<Comment>Hook-обработчик выбросил исключение. Ошибка изолирована — run продолжается. Payload: {hook_name, error_text}.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SecretRotated</Name>
					<Comment>Ротация API-ключа или токена агента. Payload: {secret_kind} без значения ключа.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AuditPurged</Name>
					<Comment>Регламентная очистка ar_СобытияЗапуска завершена. Payload: {deleted_count, older_than_days}.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Expired</Name>
					<Comment>Pending-запись очереди approval истекла по TTL. Payload: {approval_id, ttl_hours}.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RunInterruptedBySweeper</Name>
					<Comment>Зависший запуск помечен Interrupted регламентным заданием ar_ОчисткаЗависших (SCHED-04). Payload: {reason, threshold_sec}.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>MemoryProposed</Name>
					<Comment>Фиксируется при постановке proposal-записи в ar_ОчередьApproval регламентным заданием SCHED-09. Payload: {agents_processed, proposals_count, period_start}.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WebhookTriggerAccepted</Name>
					<Comment>Агент запущен через HTTP POST /v1/agents/{id}/trigger (HTTPS-01). Payload: {agent_id, run_id, trigger, dry_run}.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ActionExecuted</Name>
					<Comment>Approved-действие фактически исполнено (объект записан). Payload: {approval_id, tool_name, document_ref}.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ActionExecutionFailed</Name>
					<Comment>Approved-действие не исполнено: объект не записан. Payload: {approval_id, tool_name, reason}.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PiiRuleChanged</Name>
					<Comment>Изменение/выключение/удаление правила в ar_ПравилаМаскированияПДн (PII-06). Payload: {action, object, field_name, masking_method, enabled, changed_by} без значения защищаемого поля.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ToolCodeChanged</Name>
					<Comment>Изменение ar_КодРеализации у tool в режиме «Код» (создание/редактирование), зафиксированное в Catalogs.ar_Tools.ObjectModule.ПередЗаписью (SEC-TOOL-01). Payload: {tool, actor, code_hash, has_code} — код НЕ пишется в payload, только SHA-256 хеш.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ToolCodePolicyChanged</Name>
					<Comment>Включение/выключение константы ar_РазрешитьТулыВРежимеКод через форму ar_Настройки (SEC-TOOL-01). Отдельно от ToolCodeChanged — это изменение политики диспетчеризации code-тулов, а не конкретного tool. Payload: {old_value, new_value, actor}.</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ar_Tools/Ext/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, Александр Барабанов
//
// AgentRunner для 1С — свободное программное обеспечение: вы можете
// распространять и/или изменять его на условиях GNU Affero General Public
// License версии 3, опубликованной Free Software Foundation.
//
// Программа распространяется в надежде, что она будет полезной, но БЕЗ
// КАКИХ-ЛИБО ГАРАНТИЙ. Подробности — в файле LICENSE в корне репозитория
// и по ссылке: https://www.gnu.org/licenses/agpl-3.0.html
//
// Исходный код проекта:
// https://github.com/AI-1C-Expert/agentrunner
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Модуль объекта справочника ar_Tools.
//
// Зона ответственности (META-12):
//   - валидация формата реквизита ar_Имя (snake_case: строчные латинские буквы, цифры, подчёркивания);
//   - проверка уникальности ar_Имя на уровне приложения (запросом, исключая текущий элемент);
//   - заполнение Наименования = ar_Имя при пустом наименовании, чтобы карточка
//     отображалась осмысленно (DefaultPresentation = AsDescription);
//   - предупреждение (без блокировки) о невалидном JSON в ar_JSONManifest;
//   - режим реализации «Код» (ar_ТипРеализации): ar_ОбщийМодуль/ar_ИмяПроцедуры
//     не обязательны, вместо них требуется непустой ar_КодРеализации.
//
// Проверка уровня платформы (уникальный индекс) для произвольных реквизитов
// справочника недоступна в XML-метаданных - программная проверка ниже является
// обязательным уровнем защиты. См. DEV-NOTE в .docs/specs/META-12.md.

#Область ОбработчикиСобытий

// Платформенный обработчик проверки заполнения реквизитов.
// Вызывается перед записью элемента.
//
// Параметры:
//  Отказ                  - Булево          - флаг отказа от записи.
//  ПроверяемыеРеквизиты   - Массив из Строка - список реквизитов, проверяемых платформой.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	// При обмене данными - пропускаем валидацию.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	МассивНепроверяемыхРеквизитов = Новый Массив;

	// Режим реализации «Код»: tool реализован произвольным кодом 1С
	// (ar_КодРеализации), общий модуль и процедура не нужны - исключаем их из
	// платформенной проверки обязательности, но требуем непустой код.
	Если СокрЛП(ar_ТипРеализации) = "Код" Тогда

		МассивНепроверяемыхРеквизитов.Добавить("ar_ОбщийМодуль");
		МассивНепроверяемыхРеквизитов.Добавить("ar_ИмяПроцедуры");

		Если ПустаяСтрока(ar_КодРеализации) Тогда
			ТекстСообщения = НСтр(
				"ru = 'Для tool в режиме «Код» необходимо заполнить код 1С (ar_КодРеализации)';
				|en = 'A tool in ""Code"" mode requires the 1C code (ar_КодРеализации) to be filled'");
			ОбщегоНазначения.СообщитьПользователю(
				ТекстСообщения,
				Ссылка,
				"Объект.ar_КодРеализации",
				,
				Отказ);
		КонецЕсли;

	КонецЕсли;

	// Проверка формата ar_Имя - только если оно заполнено
	// (если пусто - стандартная проверка обязательности уже сработает).
	Если ЗначениеЗаполнено(ar_Имя) Тогда

		Если Не ar_ИмяКорректноеSnakeCase(ar_Имя) Тогда
			ТекстСообщения = НСтр(
				"ru = 'Имя tool должно быть в snake_case: только строчные латинские буквы, цифры и подчёркивания (получено: «%1»)';
				|en = 'Tool name must be snake_case: lowercase latin letters, digits and underscores only (got: ""%1"")'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ar_Имя);
			ОбщегоНазначения.СообщитьПользователю(
				ТекстСообщения,
				Ссылка,
				"Объект.ar_Имя",
				,
				Отказ);
		ИначеЕсли ar_ЕстьДубльИмени(ar_Имя, Ссылка) Тогда
			ТекстСообщения = НСтр(
				"ru = 'Tool с именем «%1» уже существует в справочнике';
				|en = 'A tool named ""%1"" already exists in the catalog'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ar_Имя);
			ОбщегоНазначения.СообщитьПользователю(
				ТекстСообщения,
				Ссылка,
				"Объект.ar_Имя",
				,
				Отказ);
		КонецЕсли;

	КонецЕсли;

	// Предупреждение о невалидном JSON-манифесте - не блокирует запись.
	Если ЗначениеЗаполнено(ar_JSONManifest) И Не ar_JSONВалиден(ar_JSONManifest) Тогда
		ТекстПредупреждения = НСтр(
			"ru = 'Внимание: JSONManifest не является валидным JSON. LLM не получит описание этого tool, пока манифест не будет исправлен.';
			|en = 'Warning: JSONManifest is not valid JSON. LLM will not see this tool description until the manifest is fixed.'");
		ОбщегоНазначения.СообщитьПользователю(
			ТекстПредупреждения,
			Ссылка,
			"Объект.ar_JSONManifest");
	КонецЕсли;

	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(
		ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);

КонецПроцедуры

// Платформенный обработчик перед записью.
// Используется для авто-заполнения Наименования значением ar_Имя и (SEC-TOOL-01)
// для фиксации audit-события при изменении кода реализации tool в режиме «Код».
//
// Параметры:
//  Отказ - Булево - флаг отказа от записи.
//
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	// Если наименование пустое - синхронизируем с ar_Имя для удобства отображения.
	Если ПустаяСтрока(Наименование) И ЗначениеЗаполнено(ar_Имя) Тогда
		Наименование = ar_Имя;
	КонецЕсли;

	ar_ЗафиксироватьИзменениеКодаTool();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииSecTool01

// SEC-TOOL-01: зафиксировать audit-событие ToolCodeChanged при создании нового
// tool в режиме «Код» с непустым кодом или при изменении ar_КодРеализации
// существующего tool относительно версии, хранящейся в ИБ. Не пишет сам код в
// payload - только факт изменения и его SHA-256 хеш (утечка потенциально
// чувствительного кода в audit-лог недопустима).
//
// Знач в параметрах ПередЗаписью не даёт «старое» состояние объекта - читаем
// его отдельным запросом по Ссылка, если объект не новый.
//
Процедура ar_ЗафиксироватьИзменениеКодаTool()

	Если СокрЛП(ar_ТипРеализации) <> "Код" Тогда
		Возврат;
	КонецЕсли;

	СтароеЗначениеКода = "";
	Если Не ЭтотОбъект.ЭтоНовый() Тогда
		СтароеЗначениеКода = ar_СтароеЗначениеКодаРеализации(Ссылка);
	КонецЕсли;

	Если СтароеЗначениеКода = ar_КодРеализации Тогда
		// Код не менялся. Совпадение возможно на "" = "" только при создании
		// нового tool с пустым ar_КодРеализации - но платформа вызывает
		// ОбработкаПроверкиЗаполнения (и, соответственно, Отказ = Истина при
		// пустом коде, см. выше) СТРОГО ДО ПередЗаписью, поэтому этот
		// обработчик до записи с пустым кодом в режиме "Код" не доходит.
		Возврат;
	КонецЕсли;

	ТекущийПользователь = Пользователи.ТекущийПользователь();

	ДанныеСобытия = Новый Структура;
	ДанныеСобытия.Вставить("tool", ar_Имя);
	ДанныеСобытия.Вставить("actor", Строка(ТекущийПользователь));
	ДанныеСобытия.Вставить("code_hash", ar_ХешКодаSHA256(ar_КодРеализации));
	ДанныеСобытия.Вставить("has_code", Не ПустаяСтрока(ar_КодРеализации));

	ar_AuditЗащищённыйРежим.ЗаписатьСобытиеПривилегированно(
		"", Перечисления.ar_ТипСобытия.ToolCodeChanged, ДанныеСобытия);

	// Дублирующая запись в служебный лог для быстрой технической диагностики
	// (проект разделяет "audit для безопасности" и "служебный лог для
	// диагностики" - обе фиксации, не одна вместо другой). ar_СлужебныйЛог.
	// Записать сам по себе best-effort (не пробрасывает исключений), поэтому
	// дополнительная защита Попытка здесь не требуется.
	ar_СлужебныйЛог.Записать(
		"Catalogs.ar_Tools.ObjectModule",
		"tool_code_changed",
		ar_JSON.ВЗначениеJSON(ДанныеСобытия));

КонецПроцедуры

// Прочитать текущее (до применения изменений в этой транзакции) значение
// ar_КодРеализации по ссылке. Отдельный запрос вместо Знач в параметрах
// ПередЗаписью, который «старого» состояния объекта не даёт.
//
// Параметры:
//  СсылкаTool - СправочникСсылка.ar_Tools - ссылка на существующий элемент.
//
// Возвращаемое значение:
//  Строка - значение ar_КодРеализации в ИБ на момент вызова, "" если не найдено.
//
Функция ar_СтароеЗначениеКодаРеализации(Знач СсылкаTool)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Tools.ar_КодРеализации КАК КодРеализации
		|ИЗ
		|	Справочник.ar_Tools КАК Tools
		|ГДЕ
		|	Tools.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", СсылкаTool);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КодРеализации;
	КонецЕсли;

	Возврат "";

КонецФункции

// SEC-TOOL-01/UC-4: SHA-256 хеш кода реализации в hex, для audit-payload.
// Хеш фиксирует факт изменения байтов кода, не его содержание (diff/ревью
// человеком - вне рамок этой задачи, см. риски в .docs/specs/SEC-TOOL-01.md).
//
// Параметры:
//  Код - Строка - текст ar_КодРеализации.
//
// Возвращаемое значение:
//  Строка - SHA-256 хеш в hex без пробелов, "" для пустого кода.
//
Функция ar_ХешКодаSHA256(Знач Код)

	Если ПустаяСтрока(Код) Тогда
		Возврат "";
	КонецЕсли;

	Возврат ОбщегоНазначения.КонтрольнаяСуммаСтрокой(Код, ХешФункция.SHA256);

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Проверяет, что строка соответствует формату snake_case:
// только строчные латинские буквы (a-z), цифры (0-9) и подчёркивания (_).
// Пустая строка считается некорректной.
//
// Параметры:
//  Имя - Строка - проверяемое значение.
//
// Возвращаемое значение:
//  Булево - Истина, если формат корректный.
//
Функция ar_ИмяКорректноеSnakeCase(Имя)

	Если ПустаяСтрока(Имя) Тогда
		Возврат Ложь;
	КонецЕсли;

	ДопустимыеСимволы = "abcdefghijklmnopqrstuvwxyz0123456789_";
	Для Индекс = 1 По СтрДлина(Имя) Цикл
		Символ = Сред(Имя, Индекс, 1);
		Если СтрНайти(ДопустимыеСимволы, Символ) = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;

	Возврат Истина;

КонецФункции

// Проверяет наличие другого элемента справочника с таким же ar_Имя.
//
// Параметры:
//  ПроверяемоеИмя - Строка - имя для поиска дубля.
//  ТекущаяСсылка  - СправочникСсылка.ar_Tools - ссылка текущего элемента (исключается из поиска).
//
// Возвращаемое значение:
//  Булево - Истина, если дубль найден.
//
Функция ar_ЕстьДубльИмени(ПроверяемоеИмя, ТекущаяСсылка)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Tools.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ar_Tools КАК Tools
		|ГДЕ
		|	Tools.ar_Имя = &Имя
		|	И Tools.Ссылка <> &ТекущаяСсылка";

	Запрос.УстановитьПараметр("Имя", ПроверяемоеИмя);
	Запрос.УстановитьПараметр("ТекущаяСсылка", ТекущаяСсылка);

	Возврат Не Запрос.Выполнить().Пустой();

КонецФункции

// Простая проверка: является ли строка валидным JSON.
// Использует платформенный ПрочитатьJSON. Возвращает Ложь при любом исключении.
//
// Параметры:
//  Текст - Строка - проверяемый JSON.
//
// Возвращаемое значение:
//  Булево - Истина, если строка парсится как JSON.
//
Функция ar_JSONВалиден(Текст)

	Результат = Ложь;
	ЧтениеJSON = Неопределено;

	Попытка
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Текст);
		ПрочитатьJSON(ЧтениеJSON);
		Результат = Истина;
	Исключение
		Результат = Ложь;
	КонецПопытки;

	// При невалидном JSON (или ошибке конструктора/УстановитьСтроку выше) поток
	// мог остаться в неконсистентном состоянии - Закрыть() сам способен
	// выбросить исключение. Результат уже определён выше (Истина/Ложь по
	// исходу разбора JSON), вторичная ошибка закрытия потока на него не
	// влияет - гасим её отдельной попыткой, фиксируя факт в журнале
	// регистрации (единственное содержательное действие, доступное здесь).
	Если ЧтениеJSON <> Неопределено Тогда
		Попытка
			ЧтениеJSON.Закрыть();
		Исключение
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'ar_Tools.ar_JSONВалиден'; en = 'ar_Tools.ar_JSONВалиден'"),
				УровеньЖурналаРегистрации.Ошибка,
				,
				,
				НСтр("ru = 'Ошибка закрытия потока ЧтениеJSON после проверки валидности - подавлена, не влияет на результат проверки.';
					|en = 'Error closing the ЧтениеJSON stream after validity check - suppressed, does not affect the check result.'"));
		КонецПопытки;
	КонецЕсли;

	Возврат Результат;

КонецФункции

#КонецОбласти
